tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# AVH edition of git-flow
brew "git-flow-avh"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Ruby version manager
brew "rbenv"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "1password-beta"
cask "airtable"
cask "alfred"
cask "bettertouchtool"
cask "blue-jeans"
cask "brave-browser"
cask "cyberduck"
cask "dash"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"
cask "flux"
cask "folding-at-home"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "grammarly"
cask "hey"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kap"
cask "ksdiff"
cask "loom"
cask "ngrok"
cask "notion"
cask "pdf-expert"
cask "postgres"
cask "postman"
cask "setapp"
cask "sf-symbols"
cask "sketch"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "sublime-merge"
cask "synergy-beta"
cask "toggl"
cask "unity-hub"
cask "visual-studio-code"
cask "windscribe"
cask "zeplin"
cask "zoomus"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Bear", id: 1091189122
mas "Clocker", id: 1056643111
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Spark", id: 1176895641
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
