tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "vitorgalvao/tiny-scripts"
# Java build tool
brew "ant"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Generate Dash documentation from HTML files
brew "dashing"
# Distributed search & analytics engine
brew "elasticsearch"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library for command-line editing
brew "readline"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Cross platform, open source .NET development framework
brew "mono"
# Open source relational database management system
brew "mysql"
# Manage multiple NodeJS versions
brew "nodenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SOund eXchange: universal sound sample translator
brew "sox"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "android-studio"
cask "betterzipql"
cask "blender"
cask "boostnote"
cask "brave-browser"
cask "charles"
cask "cyberduck"
cask "daisydisk"
cask "dash"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "duet"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "fork"
cask "framer-x"
cask "gitkraken"
cask "google-chrome-canary"
cask "google-photos-backup-and-sync"
cask "gpg-suite"
cask "horos"
cask "idrive"
cask "iina"
cask "imageoptim"
cask "java"
cask "kap"
cask "kap-beta"
cask "keybase"
cask "ksdiff"
cask "meshlab"
cask "microsoft-teams"
cask "minecraft"
cask "mono-mdk"
cask "mountain-duck"
cask "ngrok"
cask "numi"
cask "opensim"
cask "parallels"
cask "pdf-expert"
cask "pgadmin4"
cask "plug"
cask "postgres"
cask "postman"
cask "provisionql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "quik"
cask "r-app"
cask "rstudio"
cask "sequel-pro"
cask "setapp"
cask "sketch"
cask "skyfonts"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "station"
cask "sublime-merge"
cask "sublime-text"
cask "subsurface"
cask "suunto-dm5"
cask "tad"
cask "teamviewer"
cask "toggldesktop"
cask "unity-hub"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "windscribe"
cask "zeplin"
cask "zoomus"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Apple Configurator 2", id: 1037126344
mas "Balance Lock", id: 1019371109
mas "Bear", id: 1091189122
mas "Clocker", id: 1056643111
mas "Evernote", id: 406056744
mas "File Peek", id: 1194883472
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Prepo", id: 476533227
mas "SketchBook", id: 863486266
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
